[
    {
        "title": "The Darkside Detective A Fumble in the Dark",
        "id": "9e3c580751a94c6d8a1b8b08b2e3d21f",
        "description": "Join Detective McQueen as he puzzles his way through 6 cases, risking life and pixelated limb to solve the macabre mysteries that plague the poor town.",
        "original_price_fmt": "‏6.99 US$",
        "discount_price_fmt": "0",
        "currency": "USD",
        "expiry_date": null
    },
    {
        "title": "Eternal Threads",
        "id": "921e40c4c69f4d728914ca2a4f0aa407",
        "description": "Eternal Threads is a single-player, first-person story-driven puzzle game of time manipulation, choice and consequence.",
        "original_price_fmt": "‏9.29 US$",
        "discount_price_fmt": "‏1.85 US$",
        "currency": "USD",
        "expiry_date": null
    },
    {
        "title": "Ghostrunner 2",
        "id": "be5600439b434624802764f704755cde",
        "description": "Ghostrunner 2 لعبة رعب صعبة من منظور الشخص الأول في عالم السايبر بانك بعد نهاية العالم. وتضم كل ما أحبه المعجبون في Ghostrunner بالإضافة إلى قتالات زعماء رائعة وقصة تفاعلية جديدة ومستويات مشوقة بالدراجة النارية ومهارات محسّنة والمزيد من أكشن النينجا الآلية. ",
        "original_price_fmt": "‏27.99 US$",
        "discount_price_fmt": "‏5.59 US$",
        "currency": "USD",
        "expiry_date": null
    },
    {
        "title": "Castlevania Anniversary Collection",
        "id": "8f80897c0b6e4e678fed08da169d44be",
        "description": "Konami's Castlevania Anniversary Collection traces the origins of the historic vampire franchise. Included is a unique eBook with details provided by developers, artists and others inspired by the Castlevania legacy which sheds a fresh light into the world of Castlevania.",
        "original_price_fmt": "‏10.49 US$",
        "discount_price_fmt": "‏4.19 US$",
        "currency": "USD",
        "expiry_date": null
    },
    {
        "title": "Monument Valley",
        "id": "f967cff9761c4198b4e972cfd71e40d7",
        "description": "انطلق في رحلة مغفرة عبر بيئات مستحيلة وألغاز خيالية. جرب لعبة الألغاز التأملية والباعثة على الاسترخاء هذه من خلال التحكم في الآثار وإنشاء مسارات مستمرة التطور لاستكشاف عوالم جديدة سريالية غامضة.",
        "original_price_fmt": "‏4.99 US$",
        "discount_price_fmt": "‏1.74 US$",
        "currency": "USD",
        "expiry_date": null
    },
    {
        "title": "Nobody Wants to Die",
        "id": "9da459f7c3984877bd5a12bdc3b6b3af",
        "description": "انغمر في عالم من الديستوبيا في قلب نيويورك عام 2329. ستلعب بشخصية المحقق \"جيمس كارا\" الذي يخاطر بكل شيء أثناء ملاحقته لقاتل متسلسل يستهدف نخبة المدينة؛ وعليك استخدام التكنولوجيا المتقدمة لتحقيق ذلك في هذه القصة التفاعلية ذات الأجواء السوداوية.",
        "original_price_fmt": "‏18.99 US$",
        "discount_price_fmt": "0",
        "currency": "USD",
        "expiry_date": null
    }
]